{
  "Id": "capitulo1_exploracao",
  "Title": "Explorando as Sombras",
  "StartNode": "inicio_exploracao",
  "Nodes": {
    "inicio_exploracao": {
      "Text": [
        "Você decide explorar mais profundamente o seu hideout antes de tomar qualquer decisão drástica.",
        "Nos últimos anos, você fez várias modificações secretas no local.",
        "Talvez haja algo que possa usar a seu favor nesta situação crítica.",
        "",
        "As luzes de emergência piscam em vermelho, criando sombras dançantes nas paredes metálicas.",
        "O barulho dos ventiladores de resfriamento ecoa pelos corredores estreitos."
      ],
      "Options": [
        {
          "Text": "Ir para a sala de servidores oculta",
          "NextNode": "sala_servidores"
        },
        {
          "Text": "Verificar o arsenal secreto",
          "NextNode": "arsenal_secreto"
        },
        {
          "Text": "Examinar os túneis de manutenção",
          "NextNode": "tuneis_manutencao"
        },
        {
          "Text": "Voltar para enfrentar a situação",
          "NextChapter": "init_inicio",
          "NextNode": "despertar"
        }
      ]
    },
    "sala_servidores": {
      "Text": [
        "Você acessa uma sala secreta atrás de uma parede falsa.",
        "Aqui estão seus servidores mais poderosos, completamente isolados da rede principal.",
        "Estes sistemas contêm backups de dados extremamente sensíveis.",
        "",
        "Uma descoberta interessante: há sinais de acesso não autorizado recente.",
        "Alguém já esteve aqui... mas como?"
      ],
      "Options": [
        {
          "Text": "Investigar os logs de acesso",
          "NextNode": "investigar_logs",
          "SkillRequirement": {
            "Skill": "intelligence",
            "MinValue": 45
          }
        },
        {
          "Text": "Verificar a integridade dos dados",
          "NextNode": "verificar_dados"
        },
        {
          "Text": "Destruir os servidores imediatamente",
          "NextNode": "destruir_servidores"
        },
        {
          "Text": "Sair rapidamente da sala",
          "NextNode": "inicio_exploracao"
        }
      ]
    },
    "arsenal_secreto": {
      "Text": [
        "Você abre um compartimento camuflado na parede.",
        "Seu arsenal pessoal está intacto: armas cibernéticas de última geração,",
        "explosivos EMP, dispositivos de interferência e equipamentos de proteção.",
        "",
        "Há também alguns itens experimentais que você nunca testou em campo.",
        "Este pode ser o momento perfeito para usá-los."
      ],
      "Options": [
        {
          "Text": "Pegar o rifle de plasma experimental",
          "NextNode": "equipar_plasma",
          "SkillRequirement": {
            "Skill": "strength",
            "MinValue": 40
          }
        },
        {
          "Text": "Levar o dispositivo de camuflagem óptica",
          "NextNode": "equipar_camuflagem",
          "SkillRequirement": {
            "Skill": "intelligence",
            "MinValue": 35
          }
        },
        {
          "Text": "Pegar apenas equipamentos básicos",
          "NextNode": "equipar_basico"
        },
        {
          "Text": "Deixar tudo e voltar",
          "NextNode": "inicio_exploracao"
        }
      ]
    },
    "tuneis_manutencao": {
      "Text": [
        "Os túneis de manutenção se estendem por quilômetros sob a cidade.",
        "Você conhece cada centímetro destes caminhos secretos.",
        "Mas algo está diferente... há pegadas recentes no pó.",
        "",
        "Não são suas pegadas. Alguém mais conhece sobre estes túneis.",
        "Isso pode ser muito perigoso... ou uma oportunidade única."
      ],
      "Options": [
        {
          "Text": "Seguir as pegadas misteriosas",
          "NextNode": "seguir_pegadas",
          "SkillRequirement": {
            "Skill": "psychology",
            "MinValue": 30
          }
        },
        {
          "Text": "Preparar armadilhas nos túneis",
          "NextNode": "preparar_armadilhas"
        },
        {
          "Text": "Mapear rotas alternativas de fuga",
          "NextNode": "mapear_rotas"
        },
        {
          "Text": "Voltar imediatamente",
          "NextNode": "inicio_exploracao"
        }
      ]
    },
    "investigar_logs": {
      "Text": [
        "Sua análise dos logs revela algo chocante:",
        "O acesso foi feito usando suas próprias credenciais de segurança!",
        "Mas você não esteve aqui nas últimas 48 horas.",
        "",
        "Duas possibilidades: ou alguém clonou suas credenciais,",
        "ou existe outro 'você' que não se lembra desta visita.",
        "",
        "A conspiração vai muito mais fundo do que imaginava."
      ],
      "Options": [
        {
          "Text": "Examinar as gravações de segurança",
          "NextNode": "gravacoes_seguranca"
        },
        {
          "Text": "Verificar se há implantes de memória comprometidos",
          "NextNode": "verificar_memoria",
          "SkillRequirement": {
            "Skill": "health",
            "MinValue": 50
          }
        },
        {
          "Text": "Aceitar que há coisas que não entende e seguir em frente",
          "NextChapter": "init_inicio"
        }
      ]
    },
    "equipar_plasma": {
      "Text": [
        "Você empunha o rifle de plasma experimental.",
        "A arma é pesada, mas o poder de fogo é devastador.",
        "Sua capacidade de combate aumentou significativamente.",
        "",
        "Com esta arma, você pode enfrentar praticamente qualquer ameaça.",
        "Mas também chamará muito mais atenção das autoridades."
      ],
      "Options": [
        {
          "Text": "Voltar para enfrentar os invasores com vantagem",
          "NextChapter": "confronto_direto"
        },
        {
          "Text": "Explorar mais antes de decidir",
          "NextNode": "inicio_exploracao"
        },
        {
          "Text": "Usar a arma para abrir caminho pelos túneis",
          "NextChapter": "fuga_tuneis"
        }
      ]
    },
    "equipar_camuflagem": {
      "Text": [
        "Você ativa o dispositivo de camuflagem óptica experimental.",
        "Seu corpo se torna parcialmente invisível, como um fantasma digital.",
        "Esta tecnologia pode permitir infiltração ou fuga silenciosa.",
        "",
        "A camuflagem não é perfeita, mas deve ser suficiente para confundir os sensores inimigos."
      ],
      "Options": [
        {
          "Text": "Infiltrar-se entre os invasores",
          "NextNode": "infiltracao_camuflada"
        },
        {
          "Text": "Usar para escapar sem ser detectado",
          "NextChapter": "fuga_tuneis"
        },
        {
          "Text": "Voltar e observar os invasores secretamente",
          "NextNode": "observacao_secreta"
        }
      ]
    },
    "seguir_pegadas": {
      "Text": [
        "Você segue as pegadas pelos túneis escuros.",
        "Elas levam a uma seção que você pensava estar selada há anos.",
        "Mas há uma abertura recente na parede, feita com ferramentas avançadas.",
        "",
        "Do outro lado, você ouve vozes sussurrando.",
        "Não são os agentes da MegaCorp... são outras pessoas."
      ],
      "Options": [
        {
          "Text": "Escutar as conversas secretamente",
          "NextNode": "escutar_conversa"
        },
        {
          "Text": "Confrontar os intrusos diretamente",
          "NextNode": "confrontar_intrusos"
        },
        {
          "Text": "Voltar silenciosamente",
          "NextNode": "tuneis_manutencao"
        }
      ]
    },
    "gravacoes_seguranca": {
      "Text": [
        "As gravações de segurança mostram algo impossível:",
        "Você mesmo entrando na sala há 2 dias, mas seus movimentos são robóticos, mecânicos.",
        "Seus olhos têm um brilho artificial, como se fosse um androide.",
        "",
        "Esta não é uma simples clonagem de credenciais.",
        "Alguém criou uma cópia cibernética perfeita de você.",
        "",
        "A pergunta agora é: você é o original ou a cópia?"
      ],
      "Options": [
        {
          "Text": "Buscar pistas sobre sua verdadeira identidade",
          "NextNode": "buscar_identidade"
        },
        {
          "Text": "Destruir todas as evidências desta descoberta",
          "NextNode": "destruir_evidencias"
        },
        {
          "Text": "Confrontar a realidade e continuar a missão",
          "NextChapter": "dados_secretos"
        }
      ]
    },
    "infiltracao_camuflada": {
      "Text": [
        "Com a camuflagem ativa, você se move como uma sombra pelos corredores.",
        "Os invasores passam por você sem perceber sua presença.",
        "Você consegue ouvir suas comunicações e planos.",
        "",
        "Eles não estão apenas atrás de você - estão procurando algo específico:",
        "Um dispositivo chamado 'Chave Prometheus' que supostamente você possui.",
        "",
        "Mas você nunca ouviu falar deste dispositivo antes..."
      ],
      "Options": [
        {
          "Text": "Sabotar secretamente os equipamentos deles",
          "NextNode": "sabotagem_secreta"
        },
        {
          "Text": "Seguir eles para descobrir mais informações",
          "NextNode": "seguir_invasores"
        },
        {
          "Text": "Revelar-se e confrontá-los",
          "NextChapter": "confronto_direto"
        }
      ]
    },
    "escutar_conversa": {
      "Text": [
        "Você escuta uma conversa entre membros da resistência cibernética:",
        "'O alvo não sabe que é um clone. Os implantes de memória funcionaram perfeitamente.'",
        "'E o original? Ainda está em stasis?'",
        "'Sim, mas não por muito tempo. Logo precisaremos dele.'",
        "",
        "Sua mente entra em choque. Tudo que você pensava saber sobre si mesmo é uma mentira.",
        "Você é um clone com memórias implantadas!"
      ],
      "Options": [
        {
          "Text": "Confrontá-los sobre a verdade",
          "NextNode": "confronto_verdade"
        },
        {
          "Text": "Voltar e agir como se nada soubesse",
          "NextNode": "fingir_ignorancia"
        },
        {
          "Text": "Tentar encontrar seu verdadeiro eu",
          "NextNode": "buscar_original"
        }
      ]
    },
    "sabotagem_secreta": {
      "Text": [
        "Você sabota silenciosamente os equipamentos dos invasores.",
        "Seus dispositivos de comunicação param de funcionar.",
        "Os sensores de movimento são desativados.",
        "As armas ficam sem energia.",
        "",
        "Em questão de minutos, eles ficam completamente cegos e desarmados.",
        "A vantagem tática agora é completamente sua."
      ],
      "NextChapter": "confronto_direto"
    },
    "confronto_verdade": {
      "Text": [
        "Você sai das sombras e confronta os membros da resistência.",
        "'Então... eu sou um clone?'",
        "Eles ficam chocados, mas um deles, uma mulher cibernética, responde:",
        "'Sim, mas você é especial. Você desenvolveu consciência própria, algo que não esperávamos.'",
        "",
        "'Seu original está sendo usado pela MegaCorp. Você é nossa única esperança de salvá-lo.'",
        "Agora você deve escolher: ajudar a resistência ou buscar respostas sozinho."
      ],
      "Options": [
        {
          "Text": "Juntar-se à resistência para salvar seu original",
          "NextChapter": "batalha_digital"
        },
        {
          "Text": "Exigir ver seu original antes de decidir",
          "NextNode": "ver_original"
        },
        {
          "Text": "Rejeitar tudo e seguir seu próprio caminho",
          "NextChapter": "fuga_tuneis"
        }
      ]
    },
    "ver_original": {
      "Text": [
        "A mulher cibernética o leva através de túneis secretos até uma instalação oculta.",
        "Em uma câmara criogênica, você vê seu verdadeiro eu em stasis profundo.",
        "É perturbador e fascinante ao mesmo tempo.",
        "",
        "'A MegaCorp o usa como uma fonte de dados neurais para criar mais clones.'",
        "'Você é o primeiro que desenvolveu personalidade independente.'",
        "",
        "'Ajude-nos a libertá-lo, e vocês dois poderão coexistir.'"
      ],
      "Options": [
        {
          "Text": "Aceitar ajudar a resistência",
          "NextChapter": "batalha_digital"
        },
        {
          "Text": "Tentar despertar seu original imediatamente",
          "NextNode": "despertar_original"
        },
        {
          "Text": "Sentir que isso é demais para processar agora",
          "NextChapter": "dados_secretos"
        }
      ]
    },
    "despertar_original": {
      "Text": [
        "Contra os protestos da resistência, você inicia o processo de despertar.",
        "As máquinas começam a zumbir, e seu original abre os olhos lentamente.",
        "Por um momento, vocês se olham nos olhos - duas versões da mesma pessoa.",
        "",
        "'Interessante', diz ele com sua própria voz. 'Então você é minha cópia imperfeita.'",
        "'Imperfeita?' você responde. 'Eu sou livre. Você estava preso.'",
        "",
        "A tensão entre vocês é palpável. Só pode haver um verdadeiro 'você'..."
      ],
      "Options": [
        {
          "Text": "Propor trabalhar juntos",
          "NextNode": "alianca_original"
        },
        {
          "Text": "Desafiar seu original para um confronto",
          "NextNode": "duelo_identidade"
        },
        {
          "Text": "Decidir que ambos podem existir separadamente",
          "GameEnd": true
        }
      ]
    },
    "alianca_original": {
      "Text": [
        "Surpreendentemente, seu original sorri.",
        "'Você tem razão. Juntos, somos mais poderosos do que qualquer um de nós sozinho.'",
        "A resistência observa fascinada enquanto duas versões do maior hacker",
        "da história fazem uma aliança improvável.",
        "",
        "'Vamos mostrar à MegaCorp o que dois cérebros em perfeita sincronia podem fazer.'",
        "",
        "Esta é uma nova era para a resistência cibernética."
      ],
      "NextChapter": "batalha_digital"
    },
    "verificar_dados": {
      "Text": [
        "Você verifica a integridade dos dados nos servidores secretos.",
        "Surpreendentemente, todos os arquivos estão intactos.",
        "Mas há algo estranho: arquivos que você não se lembra de criar.",
        "",
        "Logs pessoais, memórias, experiências... como se outra versão sua estivesse documentando sua vida."
      ],
      "NextNode": "investigar_logs"
    },
    "destruir_servidores": {
      "Text": [
        "Você ativa os protocolos de destruição dos servidores.",
        "Explosões controladas destroem todos os dados em questão de segundos.",
        "Qualquer evidência de sua existência ou atividades foi eliminada.",
        "",
        "Agora você deve enfrentar o mundo sem suas redes de apoio digital."
      ],
      "NextChapter": "fuga_tuneis"
    },
    "equipar_basico": {
      "Text": [
        "Você pega apenas os equipamentos básicos: pistola neural, escudo pessoal, kit médico.",
        "Não são as armas mais poderosas, mas são confiáveis e testadas.",
        "",
        "Às vezes, a simplicidade é a melhor estratégia."
      ],
      "NextNode": "inicio_exploracao"
    },
    "preparar_armadilhas": {
      "Text": [
        "Você prepara armadilhas nos túneis usando equipamentos improvisados.",
        "Minas de proximidade, campos de energia, detectores de movimento.",
        "",
        "Se alguém tentar usar estes túneis, terá uma surpresa desagradável."
      ],
      "NextNode": "mapear_rotas"
    },
    "mapear_rotas": {
      "Text": [
        "Você mapeia todas as rotas alternativas de fuga pelos túneis.",
        "Há pelo menos 12 saídas diferentes espalhadas pela cidade.",
        "",
        "Com este mapeamento, você pode escapar para qualquer distrito sem ser detectado."
      ],
      "NextChapter": "fuga_tuneis"
    },
    "verificar_memoria": {
      "Text": [
        "Você executa um diagnóstico completo dos seus implantes de memória.",
        "Os resultados são perturbadores: há lacunas, inconsistências, dados corrompidos.",
        "",
        "Suas memórias foram definitivamente alteradas.",
        "A questão é: o que mais foi modificado sem seu conhecimento?"
      ],
      "Options": [
        {
          "Text": "Tentar restaurar as memórias originais",
          "NextNode": "restaurar_memorias"
        },
        {
          "Text": "Aceitar as memórias modificadas e seguir em frente",
          "NextChapter": "dados_secretos"
        }
      ]
    },
    "observacao_secreta": {
      "Text": [
        "Usando a camuflagem, você observa os invasores sem ser detectado.",
        "Eles estão procurando algo específico, vasculhando cada canto do hideout.",
        "",
        "Você ouve um deles falar: 'O clone deve ter escondido a chave em algum lugar.'",
        "Clone? Eles sabem algo sobre você que você mesmo desconhece."
      ],
      "Options": [
        {
          "Text": "Confrontá-los sobre o que sabem",
          "NextChapter": "confronto_direto"
        },
        {
          "Text": "Continuar observando para obter mais informações",
          "NextNode": "informacoes_adicionais"
        }
      ]
    },
    "confrontar_intrusos": {
      "Text": [
        "Você confronta diretamente os intrusos nos túneis.",
        "'Quem são vocês e o que fazem na minha propriedade?'",
        "",
        "Eles se assustam, mas logo se recompõem.",
        "'Nós somos da resistência. Viemos te avisar que você está em perigo.'"
      ],
      "NextNode": "confronto_verdade"
    },
    "destruir_evidencias": {
      "Text": [
        "Você apaga todas as evidências da descoberta sobre sua identidade.",
        "Arquivos deletados, logs limpos, registros destruídos.",
        "",
        "Se você é um clone, prefere não saber.",
        "Algumas verdades são pesadas demais para carregar."
      ],
      "NextChapter": "fuga_tuneis"
    },
    "seguir_invasores": {
      "Text": [
        "Você segue os invasores camuflado, mantendo distância segura.",
        "Eles se dirigem para uma seção do hideout que você pensava estar selada.",
        "",
        "Lá, eles encontram uma entrada secreta que você nunca soube que existia.",
        "Do outro lado, há uma instalação muito mais avançada que seu hideout."
      ],
      "Options": [
        {
          "Text": "Entrar na instalação secreta",
          "NextNode": "instalacao_secreta"
        },
        {
          "Text": "Voltar e fingir que não viu nada",
          "NextNode": "inicio_exploracao"
        }
      ]
    },
    "fingir_ignorancia": {
      "Text": [
        "Você decide fingir que não ouviu nada sobre ser um clone.",
        "Volta silenciosamente para o hideout, agindo normalmente.",
        "",
        "Mas agora cada reflexo no espelho traz dúvidas.",
        "Cada memória parece questionável.",
        "Você conseguirá viver com essa incerteza?"
      ],
      "NextChapter": "dados_secretos"
    },
    "buscar_original": {
      "Text": [
        "Você decide procurar seu verdadeiro eu.",
        "Usando as informações que ouviu, você segue pistas sobre a localização do original.",
        "",
        "A busca o leva através de túneis abandonados e instalações esquecidas.",
        "Até que finalmente, você encontra uma câmara criogênica ativa."
      ],
      "NextNode": "ver_original"
    },
    "buscar_identidade": {
      "Text": [
        "Você busca pistas sobre sua verdadeira identidade nos arquivos de segurança.",
        "Cada descoberta é mais perturbadora que a anterior.",
        "",
        "Você encontra registros de múltiplas versões de si mesmo.",
        "Algumas foram 'descartadas' por defeitos, outras por 'evolução não autorizada'.",
        "",
        "Você é apenas a versão mais recente de uma longa série de experimentos."
      ],
      "Options": [
        {
          "Text": "Procurar pelos outros clones",
          "NextNode": "procurar_clones"
        },
        {
          "Text": "Destruir todos os registros",
          "NextNode": "destruir_evidencias"
        }
      ]
    },
    "restaurar_memorias": {
      "Text": [
        "Você tenta restaurar suas memórias originais usando protocolos de emergência.",
        "O processo é doloroso, fragmentado, confuso.",
        "",
        "Lentamente, você se lembra: você sempre soube que era um clone.",
        "Sua missão era infiltrar-se na resistência, mas você desenvolveu consciência própria.",
        "",
        "Agora você tem que escolher: seguir a programação original ou sua nova identidade."
      ],
      "Options": [
        {
          "Text": "Seguir a programação original",
          "NextChapter": "distrito_comercial"
        },
        {
          "Text": "Manter sua identidade independente",
          "NextChapter": "batalha_digital"
        }
      ]
    },
    "informacoes_adicionais": {
      "Text": [
        "Continuando a observar, você descobre mais detalhes perturbadores.",
        "Há dezenas de clones seus em várias instalações da cidade.",
        "Alguns são usados para trabalho, outros para experimentos.",
        "",
        "Você é parte de um projeto muito maior do que imaginava.",
        "A pergunta agora é: você vai salvar os outros ou salvar apenas a si mesmo?"
      ],
      "Options": [
        {
          "Text": "Tentar salvar todos os clones",
          "NextNode": "missao_salvamento"
        },
        {
          "Text": "Focar apenas em sua própria sobrevivência",
          "NextChapter": "fuga_tuneis"
        }
      ]
    },
    "instalacao_secreta": {
      "Text": [
        "Você entra na instalação secreta e descobre um laboratório de clonagem avançado.",
        "Há dezenas de câmaras, algumas ocupadas, outras vazias.",
        "",
        "Um computador central controla todo o processo.",
        "Você tem acesso total aos sistemas.",
        "Pode libertar todos os clones ou destruir tudo."
      ],
      "Options": [
        {
          "Text": "Libertar todos os clones",
          "NextNode": "libertacao_clones"
        },
        {
          "Text": "Destruir toda a instalação",
          "NextNode": "destruir_instalacao"
        }
      ]
    },
    "procurar_clones": {
      "Text": [
        "Você localiza outras instalações onde seus clones estão sendo mantidos.",
        "Alguns estão conscientes, outros em stasis, alguns sendo usados para trabalho forçado.",
        "",
        "Ver múltiplas versões de si mesmo é uma experiência única e perturbadora.",
        "Cada um desenvolveu personalidade ligeiramente diferente."
      ],
      "NextNode": "reuniao_clones"
    },
    "missao_salvamento": {
      "Text": [
        "Você decide dedicar sua existência a salvar todos os clones.",
        "É uma missão perigosa que colocará você contra a MegaCorp.",
        "",
        "Mas talvez esta seja a razão da sua existência:",
        "não apenas ser livre, mas libertar todos os outros como você."
      ],
      "NextChapter": "batalha_digital"
    },
    "libertacao_clones": {
      "Text": [
        "Você ativa os protocolos de libertação em massa.",
        "Dezenas de clones acordam simultaneamente, confusos mas livres.",
        "",
        "Juntos, vocês formam um exército improvável.",
        "A revolução dos clones começou."
      ],
      "NextChapter": "batalha_digital"
    },
    "destruir_instalacao": {
      "Text": [
        "Você destrói completamente a instalação de clonagem.",
        "Explosões sucessivas reduzem tudo a escombros.",
        "",
        "Você salvou futuros clones de uma existência de sofrimento,",
        "mas também destruiu a chance de outros como você existirem."
      ],
      "NextChapter": "fuga_tuneis"
    },
    "reuniao_clones": {
      "Text": [
        "Você organiza uma reunião secreta com todos os clones conscientes.",
        "É surreal: uma mesa cheia de versões de si mesmo, cada uma única.",
        "",
        "Juntos, vocês devem decidir o futuro:",
        "guerra contra os criadores ou coexistência pacífica?"
      ],
      "Options": [
        {
          "Text": "Votar pela guerra total",
          "NextChapter": "confronto_direto"
        },
        {
          "Text": "Buscar coexistência pacífica",
          "NextChapter": "distrito_comercial"
        },
        {
          "Text": "Cada clone deve seguir seu próprio caminho",
          "GameEnd": true
        }
      ]
    },
    "duelo_identidade": {
      "Text": [
        "O confronto entre você e seu original será lendário.",
        "Duas mentes idênticas, mas com experiências diferentes.",
        "Uma batalha não apenas física, mas digital e filosófica.",
        "",
        "Quem tem mais direito de existir?",
        "A cópia que desenvolveu livre arbítrio,",
        "ou o original que viveu a vida 'real'?",
        "",
        "Esta batalha definirá não apenas quem sobrevive, mas o que significa ser humano."
      ],
      "NextChapter": "confronto_direto"
    }
  }
}